## Import Libraries

In [2]:
import pandas as pd

## Import kaggle dataset

In [100]:
mapping = pd.read_csv("data/linkedin_to_isic_rev_4_industry_mapping_0.csv")

In [101]:
employment = pd.read_excel("data/public_use-industry-employment-growth.xlsx")

In [102]:
skills_needs = pd.read_excel("data/public_use-industry-skills-needs.xlsx")

In [103]:
skill_penetration = pd.read_excel("data/public_use-skill-penetration.xlsx")

In [107]:
country_migration = pd.read_excel("data/talent_migration/country_migration.xlsx")

In [108]:
industry_migration = pd.read_excel("data/talent_migration/industry_migration.xlsx")

In [109]:
skill_migration = pd.read_excel("data/talent_migration/skill_migration.xlsx")

## Evaluation of data

### Industry mapping

In [17]:
mapping.head()

,isic_section,isic_section_name,isic_division,isic_division_name,industry_sk,industry_name,Industry_group_sk,Industry_group_name
0,A,A. Agriculture; forestry and fishing,1,"Crop and animal production, hunting and relate...",63,farming,1,Agriculture
1,A,A. Agriculture; forestry and fishing,1,"Crop and animal production, hunting and relate...",64,ranching,1,Agriculture
2,A,A. Agriculture; forestry and fishing,1,"Crop and animal production, hunting and relate...",65,dairy,1,Agriculture
3,A,A. Agriculture; forestry and fishing,3,Fishing and aquaculture,66,fishery,1,Agriculture
4,B,B. Mining and quarrying,5,Mining of coal and lignite,56,mining & metals,16,Energy and Mining

In [20]:
mapping.shape

(148, 8)

In [1]:
industry_sk = list(mapping.industry_sk.unique())
len(industry_sk)

NameError: name 'mapping' is not defined

In [19]:
mapping.describe()

       isic_division  industry_sk  Industry_group_sk
count     148.000000   148.000000         148.000000
mean       59.351351    74.432432          11.135135
std        26.277655    42.992352           6.205822
min        -9.000000    -9.000000          -9.000000
25%        47.000000    37.750000           6.000000
50%        64.000000    74.500000          11.000000
75%        81.250000   111.250000          15.000000
max        96.000000   148.000000          24.000000

In [23]:
mapping.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   isic_section         148 non-null    object
 1   isic_section_name    148 non-null    object
 2   isic_division        148 non-null    int64
 3   isic_division_name   148 non-null    object
 4   industry_sk          148 non-null    int64
 5   industry_name        148 non-null    object
 6   Industry_group_sk    148 non-null    int64
 7   Industry_group_name  148 non-null    object
dtypes: int64(3), object(5)
memory usage: 9.4+ KB

In [34]:
mapping.isnull().sum()

isic_section           0
isic_section_name      0
isic_division          0
isic_division_name     0
industry_sk            0
industry_name          0
Industry_group_sk      0
Industry_group_name    0
dtype: int64

#### Section columns

In [24]:
mapping.isic_section_name.unique()

array([' A. Agriculture; forestry and fishing',
       ' B. Mining and quarrying', ' C. Manufacturing',
       ' D. Electricity; gas, steam and air conditioning supply',
       ' F. Construction',
       ' G. Wholesale and retail trade; repair of motor vehicles and motorcycles',
       ' H. Transportation and storage',
       ' I. Accommodation and food service activities',
       ' J. Information and communication',
       ' K. Financial and insurance activities',
       ' L. Real estate activities',
       ' M. Professional, scientific and technical activities',
       ' N. Administrative and support service activities',
       ' O. Public administration and defence; compulsory social security',
       ' P. Education', ' Q. Human health and social work activities',
       ' R. Arts, entertainment and recreation',
       ' S. Other service activities', ' X. Not elsewhere classified'],
      dtype=object)

In [36]:
section_name=list(mapping.isic_section_name.unique())
len(section_name)

19

In [37]:
section=list(mapping.isic_section.unique())
len(section)

19

In [29]:
mapping.isic_section_name.value_counts()

 M. Professional, scientific and technical activities                       24
 C. Manufacturing                                                           18
 J. Information and communication                                           17
 G. Wholesale and retail trade; repair of motor vehicles and motorcycles    14
 R. Arts, entertainment and recreation                                      11
 O. Public administration and defence; compulsory social security           10
 N. Administrative and support service activities                            8
 K. Financial and insurance activities                                       7
 H. Transportation and storage                                               7
 S. Other service activities                                                 5
 Q. Human health and social work activities                                  5
 P. Education                                                                4
 A. Agriculture; forestry and fishing                                        4
 X. Not elsewhere classified                                                 4
 F. Construction                                                             3
 L. Real estate activities                                                   2
 B. Mining and quarrying                                                     2
 I. Accommodation and food service activities                                2
 D. Electricity; gas, steam and air conditioning supply                      1
Name: isic_section_name, dtype: int64

#### Division columns

In [32]:
division_name=list(mapping.isic_division_name.unique())
len(division_name)

61

In [52]:
division_name

['Crop and animal production, hunting and related service activities',
 'Fishing and aquaculture',
 'Mining of coal and lignite',
 'Extraction of crude petroleum and natural gas',
 'Manufacture of fabricated metal products, except machinery and equip',
 'Manufacture of pharmaceuticals, medicinal chemical and botanical products',
 'Manufacture of food products',
 'Manufacture of other transport equipment',
 'Manufacture of motor vehicles, trailers and semi-trailers',
 'Manufacture of chemicals and chemical products',
 'Manufacture of machinery and equipment n.e.c.',
 'Manufacture of textiles',
 'Manufacture of paper and paper products',
 'Printing and reproduction of recorded media',
 'Manufacture of computer, electronic and optical products',
 'Manufacture of rubber and plastics products',
 'Other manufacturing',
 'electricity; gas, steam and air conditioning supply',
 'Construction of buildings',
 'Not_mapped',
 'Civil engineering',
 'Retail trade, except of motor vehicles and motorcycles',
 'Wholesale trade, except of motor vehicles and motorcycles',
 'Postal and courier activities',
 'Land transport and transport via pipelines',
 'Warehousing and support activities for transportation',
 'Air transport',
 'Water transport',
 'Accommodation',
 'Food and services activities',
 'Computer programming, consultancy and related activities',
 'Telecommunications',
 'Motion picture, video and television programme production, sound recording',
 'Programming and broadcasting activities',
 'Publishing activities',
 'Information service activities',
 'Financial service activities, except insurance and pension funding',
 'Insurance, reinsurance and pension funding, except compulsory social',
 'Activities auxiliary to financial service and insurance activities',
 'Real estate activities',
 'Legal and accounting activities',
 'Activities of head offices; management consultancy activities',
 'Scientific research and development',
 'Veterinary activities',
 'Architectural and engineering activities; technical testing and analysis',
 'Advertising and market research',
 'Other professional, scientific and technical activities',
 'Travel agency, tour operator, reservation service and related activities',
 'Services to buildings and landscape activities',
 'Office administrative, office support and other business support activities',
 'Employment activities',
 'Security and investigation activities',
 'Public administration and defence; compulsory social security',
 ' Education',
 'Human health activities',
 'Creative, arts and entertainment activities',
 'Gambling and betting activities',
 'Sports activities and amusement and recreation activities',
 'Libraries, archives, museums and other cultural activities',
 'Other personal service activities',
 'Activities of professional membership organizations']

In [38]:
division=list(mapping.isic_division.unique())
len(division)

62

In [41]:
mapping

[1,
 3,
 5,
 6,
 25,
 21,
 10,
 30,
 29,
 20,
 28,
 13,
 17,
 18,
 26,
 22,
 32,
 35,
 41,
 43,
 42,
 47,
 46,
 53,
 49,
 52,
 51,
 50,
 55,
 56,
 62,
 61,
 59,
 60,
 58,
 63,
 64,
 65,
 66,
 68,
 69,
 70,
 72,
 75,
 71,
 73,
 74,
 79,
 81,
 82,
 78,
 80,
 84,
 85,
 86,
 90,
 92,
 93,
 91,
 96,
 94,
 -9]

In [50]:
filtrado = mapping.loc[mapping["isic_division"] == -9]

In [51]:
filtrado

,isic_section,isic_section_name,isic_division,isic_division_name,industry_sk,industry_name,Industry_group_sk,Industry_group_name
144,X,X. Not elsewhere classified,-9,Not_mapped,-9,Unknown,-9,ERR
145,X,X. Not elsewhere classified,-9,Not_mapped,102,program development,13,Nonprofit
146,X,X. Not elsewhere classified,-9,Not_mapped,130,think tanks,13,Nonprofit
147,X,X. Not elsewhere classified,-9,Not_mapped,131,philanthropy,13,Nonprofit

In [40]:
division_name[0:10]

['Crop and animal production, hunting and related service activities',
 'Fishing and aquaculture',
 'Mining of coal and lignite',
 'Extraction of crude petroleum and natural gas',
 'Manufacture of fabricated metal products, except machinery and equip',
 'Manufacture of pharmaceuticals, medicinal chemical and botanical products',
 'Manufacture of food products',
 'Manufacture of other transport equipment',
 'Manufacture of motor vehicles, trailers and semi-trailers',
 'Manufacture of chemicals and chemical products']

#### Industry columns

In [55]:
industry_name=list(mapping.industry_name.unique())
len(industry_name)

148

In [56]:
industry_sk=list(mapping.industry_sk.unique())
len(industry_sk)

148

In [60]:
industry_group_name=list(mapping.Industry_group_name.unique())
len(industry_group_name)

28

In [61]:
print(industry_group_name)

['Agriculture', 'Energy and Mining', 'Manufacturing', 'Healthcare', 'Media & Communications', 'Construction', 'Consumer goods', 'Retail', 'Transportation & Logistics', 'Recreation and Travel', 'Hardware & Netwoking', 'Software & IT Services', 'Entertainment', 'Finance', 'Real estate ', 'Legal', 'Corporate Services', ' Healthcare', 'Design', 'Education', 'Hardware & Networking', 'Art', 'Nonprofit', 'Public safety', 'Public Administration', 'Wellness and Fitness', 'Wellness & Fitness', 'ERR']

In [62]:
industry_group_sk=list(mapping.Industry_group_sk.unique())
len(industry_group_sk)

25

In [64]:
print(industry_group_sk)

[1, 16, 10, 12, 11, 3, 4, 24, 15, 14, 19, 8, 18, 7, 22, 9, 5, 17, 6, 2, 13, 21, 20, 23, -9]

In [66]:
filtrado2 = mapping.loc[mapping["Industry_group_sk"] == -9]

In [67]:
filtrado2

,isic_section,isic_section_name,isic_division,isic_division_name,industry_sk,industry_name,Industry_group_sk,Industry_group_name
144,X,X. Not elsewhere classified,-9,Not_mapped,-9,Unknown,-9,ERR

### Employment growth

In [68]:
employment.head()

,country_code,country_name,wb_region,wb_income,isic_section_index,isic_section_name,industry_id,industry_name,growth_rate_2015,growth_rate_2016,growth_rate_2017,growth_rate_2018,growth_rate_2019
0,ae,United Arab Emirates,Middle East & North Africa,High income,B,Mining and quarrying,56,Mining & Metals,0.078000,0.058550,0.043402,0.010048,-0.000621
1,ae,United Arab Emirates,Middle East & North Africa,High income,B,Mining and quarrying,57,Oil & Energy,0.033015,0.013479,0.017459,0.018514,0.022606
2,ae,United Arab Emirates,Middle East & North Africa,High income,C,Manufacturing,15,Pharmaceuticals,0.171367,0.136986,0.090631,0.048148,0.028423
3,ae,United Arab Emirates,Middle East & North Africa,High income,C,Manufacturing,23,Food Production,0.063351,0.038647,0.022137,0.005990,0.004317
4,ae,United Arab Emirates,Middle East & North Africa,High income,C,Manufacturing,52,Aviation & Aerospace,0.096607,0.056744,0.028673,0.015048,0.000816

In [69]:
employment.shape

(7335, 13)

In [71]:
employment.describe()

,industry_id,growth_rate_2015,growth_rate_2016,growth_rate_2017,growth_rate_2018,growth_rate_2019
count,7335.000000,7335.000000,7335.000000,7335.000000,7335.000000,7335.000000
mean,70.444853,0.000465,0.001303,0.000662,0.000499,0.000330
std,43.195772,0.057863,0.051965,0.044719,0.036628,0.027025
min,3.000000,-0.372654,-0.310484,-0.603328,-0.186667,-0.164179
25%,37.000000,-0.026549,-0.023920,-0.020628,-0.017104,-0.012658
50%,61.000000,-0.001190,-0.001036,0.000000,0.000000,-0.000468
75%,110.000000,0.023056,0.021858,0.018868,0.015649,0.011299
max,147.000000,1.084507,0.760417,0.459854,0.317073,0.345154

In [73]:
employment.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7335 entries, 0 to 7334
Data columns (total 13 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   country_code        7335 non-null   object
 1   country_name        7335 non-null   object
 2   wb_region           7335 non-null   object
 3   wb_income           7335 non-null   object
 4   isic_section_index  7335 non-null   object
 5   isic_section_name   7335 non-null   object
 6   industry_id         7335 non-null   int64
 7   industry_name       7335 non-null   object
 8   growth_rate_2015    7335 non-null   float64
 9   growth_rate_2016    7335 non-null   float64
 10  growth_rate_2017    7335 non-null   float64
 11  growth_rate_2018    7335 non-null   float64
 12  growth_rate_2019    7335 non-null   float64
dtypes: float64(5), int64(1), object(7)
memory usage: 745.1+ KB

In [76]:
employment.isnull().sum()

country_code          0
country_name          0
wb_region             0
wb_income             0
isic_section_index    0
isic_section_name     0
industry_id           0
industry_name         0
growth_rate_2015      0
growth_rate_2016      0
growth_rate_2017      0
growth_rate_2018      0
growth_rate_2019      0
dtype: int64

In [82]:
countries=list(employment.country_name.unique())
len(countries)

128

In [81]:
countries[0:10]

['United Arab Emirates',
 'Afghanistan',
 'Albania',
 'Armenia',
 'Angola',
 'Argentina',
 'Austria',
 'Australia',
 'Azerbaijan',
 'Bosnia and Herzegovina']

In [83]:
country_code=list(employment.country_code.unique())
len(country_code)

128

In [85]:
employment.wb_region.value_counts()

Europe & Central Asia         2547
Latin America & Caribbean     1227
Middle East & North Africa    1079
East Asia & Pacific           1051
Sub-Saharan Africa             917
South Asia                     360
North America                  154
Name: wb_region, dtype: int64

In [84]:
employment.wb_income.value_counts()

High income            3348
Upper middle income    1996
Lower middle income    1537
Low income              454
Name: wb_income, dtype: int64

In [87]:
section_name=list(employment.isic_section_name.unique())
print(section_name)

['Mining and quarrying', 'Manufacturing', 'Information and communication', 'Financial and insurance activities', 'Professional scientific and technical activities', 'Arts, entertainment and recreation ']

In [77]:
industry_name=list(employment.industry_name.unique())
len(industry_name)

77

### Skill needs

In [88]:
skills_needs.head()

,year,isic_section_index,isic_section_name,industry_name,skill_group_category,skill_group_name,skill_group_rank
0,2015,B,Mining and quarrying,Mining & Metals,Specialized Industry Skills,Mining,1
1,2015,B,Mining and quarrying,Mining & Metals,Soft Skills,Negotiation,2
2,2015,B,Mining and quarrying,Mining & Metals,Business Skills,Project Management,3
3,2015,B,Mining and quarrying,Mining & Metals,Business Skills,Business Management,4
4,2015,B,Mining and quarrying,Mining & Metals,Specialized Industry Skills,Earth Science,5

In [90]:
skills_needs.shape

(3500, 7)

In [92]:
skills_needs.describe()

              year  skill_group_rank
count  3500.000000       3500.000000
mean   2017.000000          5.500000
std       1.414416          2.872692
min    2015.000000          1.000000
25%    2016.000000          3.000000
50%    2017.000000          5.500000
75%    2018.000000          8.000000
max    2019.000000         10.000000

In [93]:
skills_needs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3500 entries, 0 to 3499
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   year                  3500 non-null   int64
 1   isic_section_index    3500 non-null   object
 2   isic_section_name     3500 non-null   object
 3   industry_name         3500 non-null   object
 4   skill_group_category  3500 non-null   object
 5   skill_group_name      3500 non-null   object
 6   skill_group_rank      3500 non-null   int64
dtypes: int64(2), object(5)
memory usage: 191.5+ KB

In [94]:
skills_needs.isnull().sum()

year                    0
isic_section_index      0
isic_section_name       0
industry_name           0
skill_group_category    0
skill_group_name        0
skill_group_rank        0
dtype: int64

In [95]:
skills_needs.year.unique()

array([2015, 2016, 2017, 2018, 2019])

### Skill penetration

In [89]:
skill_penetration.head()

,year,skill_group_category,skill_group_name,isic_section_index,isic_section_name,industry_name,skill_group_penetration_rate
0,2015,Business Skills,Accounts Payable,M,Professional scientific and technical activities,Accounting,0.00719
1,2015,Business Skills,Accounts Payable,M,Professional scientific and technical activities,Law Practice,0.00244
2,2015,Business Skills,Accounts Payable,M,Professional scientific and technical activities,Executive Office,0.00222
3,2015,Business Skills,Accounts Payable,C,Manufacturing,Packaging & Containers,0.00132
4,2015,Business Skills,Accounts Payable,B,Mining and quarrying,Oil & Energy,0.00132

In [96]:
skill_penetration.shape

(20780, 7)

In [97]:
skill_penetration.describe()

               year  skill_group_penetration_rate
count  20780.000000                  20780.000000
mean    2017.000000                      0.006256
std        1.414248                      0.013577
min     2015.000000                      0.000100
25%     2016.000000                      0.000600
50%     2017.000000                      0.001660
75%     2018.000000                      0.005360
max     2019.000000                      0.273000

In [98]:
skill_penetration.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20780 entries, 0 to 20779
Data columns (total 7 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   year                          20780 non-null  int64
 1   skill_group_category          20780 non-null  object
 2   skill_group_name              20780 non-null  object
 3   isic_section_index            20780 non-null  object
 4   isic_section_name             20780 non-null  object
 5   industry_name                 20780 non-null  object
 6   skill_group_penetration_rate  20780 non-null  float64
dtypes: float64(1), int64(1), object(5)
memory usage: 1.1+ MB

In [99]:
skill_penetration.isnull().sum()

year                            0
skill_group_category            0
skill_group_name                0
isic_section_index              0
isic_section_name               0
industry_name                   0
skill_group_penetration_rate    0
dtype: int64

In [117]:
skill_penetration.skill_group_category.value_counts()

Specialized Industry Skills    7610
Business Skills                6690
Tech Skills                    3505
Soft Skills                    1935
Disruptive Tech Skills         1040
Name: skill_group_category, dtype: int64

In [118]:
skill_penetration.industry_name.value_counts()

Oil & Energy                         480
Information Technology & Services    470
Health, Wellness & Fitness           465
Internet                             450
Management Consulting                435
                                    ...
Translation & Localization           175
Veterinary                           170
Photography                          165
Venture Capital & Private Equity     155
Investment Banking                   130
Name: industry_name, Length: 70, dtype: int64

### Talent migration

#### Country Migration

In [104]:
country_migration.head()

,base_country_code,base_country_name,base_lat,base_long,base_country_wb_income,base_country_wb_region,target_country_code,target_country_name,target_lat,target_long,target_country_wb_income,target_country_wb_region,net_per_10K_2015,net_per_10K_2016,net_per_10K_2017,net_per_10K_2018,net_per_10K_2019
0,ae,United Arab Emirates,23.424076,53.847818,High Income,Middle East & North Africa,af,Afghanistan,33.939110,67.709953,Low Income,South Asia,0.19,0.16,0.11,-0.05,-0.02
1,ae,United Arab Emirates,23.424076,53.847818,High Income,Middle East & North Africa,dz,Algeria,28.033886,1.659626,Upper Middle Income,Middle East & North Africa,0.19,0.25,0.57,0.55,0.78
2,ae,United Arab Emirates,23.424076,53.847818,High Income,Middle East & North Africa,ao,Angola,-11.202692,17.873887,Lower Middle Income,Sub-Saharan Africa,-0.01,0.04,0.11,-0.02,-0.06
3,ae,United Arab Emirates,23.424076,53.847818,High Income,Middle East & North Africa,ar,Argentina,-38.416097,-63.616672,High Income,Latin America & Caribbean,0.16,0.18,0.04,0.01,0.23
4,ae,United Arab Emirates,23.424076,53.847818,High Income,Middle East & North Africa,am,Armenia,40.069099,45.038189,Upper Middle Income,Europe & Central Asia,0.10,0.05,0.03,-0.01,0.02

In [110]:
country_migration.shape

(4148, 17)

In [111]:
country_migration.describe()

,base_lat,base_long,target_lat,target_long,net_per_10K_2015,net_per_10K_2016,net_per_10K_2017,net_per_10K_2018,net_per_10K_2019
count,4148.000000,4148.000000,4148.000000,4148.000000,4148.000000,4148.000000,4148.000000,4148.000000,4148.000000
mean,28.418022,21.698305,28.418022,21.698305,0.461757,0.150248,-0.080272,-0.040591,-0.022743
std,25.086012,61.937381,25.086012,61.937381,5.006530,4.201118,3.203092,3.593876,3.633247
min,-40.900557,-106.346771,-40.900557,-106.346771,-37.010000,-40.890000,-43.660000,-56.220000,-50.330000
25%,14.058324,-3.435973,14.058324,-3.435973,-0.150000,-0.190000,-0.210000,-0.210000,-0.210000
50%,35.861660,19.145136,35.861660,19.145136,0.000000,0.000000,0.000000,0.000000,0.000000
75%,47.516231,53.688046,47.516231,53.688046,0.240000,0.220000,0.160000,0.170000,0.180000
max,64.963051,179.414413,64.963051,179.414413,150.680000,124.480000,87.000000,91.410000,87.710000

In [112]:
country_migration.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4148 entries, 0 to 4147
Data columns (total 17 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   base_country_code         4148 non-null   object
 1   base_country_name         4148 non-null   object
 2   base_lat                  4148 non-null   float64
 3   base_long                 4148 non-null   float64
 4   base_country_wb_income    4148 non-null   object
 5   base_country_wb_region    4148 non-null   object
 6   target_country_code       4148 non-null   object
 7   target_country_name       4148 non-null   object
 8   target_lat                4148 non-null   float64
 9   target_long               4148 non-null   float64
 10  target_country_wb_income  4148 non-null   object
 11  target_country_wb_region  4148 non-null   object
 12  net_per_10K_2015          4148 non-null   float64
 13  net_per_10K_2016          4148 non-null   float64
 14  net_per_10K_2017          4148 non-null   float64
 15  net_per_10K_2018          4148 non-null   float64
 16  net_per_10K_2019          4148 non-null   float64
dtypes: float64(9), object(8)
memory usage: 551.0+ KB

In [113]:
country_migration.isnull().sum()

base_country_code           0
base_country_name           0
base_lat                    0
base_long                   0
base_country_wb_income      0
base_country_wb_region      0
target_country_code         0
target_country_name         0
target_lat                  0
target_long                 0
target_country_wb_income    0
target_country_wb_region    0
net_per_10K_2015            0
net_per_10K_2016            0
net_per_10K_2017            0
net_per_10K_2018            0
net_per_10K_2019            0
dtype: int64

#### Industry Migration

In [114]:
industry_migration.head()

,country_code,country_name,wb_income,wb_region,isic_section_index,isic_section_name,industry_id,industry_name,net_per_10K_2015,net_per_10K_2016,net_per_10K_2017,net_per_10K_2018,net_per_10K_2019
0,ae,United Arab Emirates,High income,Middle East & North Africa,C,Manufacturing,1,Defense & Space,378.74,127.94,8.20,68.51,49.55
1,ae,United Arab Emirates,High income,Middle East & North Africa,J,Information and communication,3,Computer Hardware,100.97,358.14,112.98,149.57,182.22
2,ae,United Arab Emirates,High income,Middle East & North Africa,J,Information and communication,4,Computer Software,1079.36,848.15,596.48,409.18,407.41
3,ae,United Arab Emirates,High income,Middle East & North Africa,J,Information and communication,5,Computer Networking,401.46,447.39,163.99,236.69,188.07
4,ae,United Arab Emirates,High income,Middle East & North Africa,J,Information and communication,6,Internet,1840.33,1368.42,877.71,852.39,519.40

In [121]:
industry_migration.shape

(5295, 13)

In [122]:
industry_migration.describe()

,industry_id,net_per_10K_2015,net_per_10K_2016,net_per_10K_2017,net_per_10K_2018,net_per_10K_2019
count,5295.000000,5295.000000,5295.000000,5295.000000,5295.000000,5295.000000
mean,65.496884,95.228831,68.194300,41.837331,31.354393,6.467590
std,41.139350,238.124020,225.550355,205.031412,217.543233,192.451055
min,1.000000,-1185.250000,-1876.780000,-1577.240000,-2025.550000,-3367.370000
25%,31.000000,-6.980000,-18.325000,-29.420000,-40.090000,-60.120000
50%,57.000000,51.390000,39.540000,31.130000,25.570000,8.740000
75%,97.500000,149.490000,135.190000,118.415000,107.825000,82.455000
max,148.000000,2280.600000,1787.580000,1981.380000,1500.000000,1820.990000

In [123]:
industry_migration.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5295 entries, 0 to 5294
Data columns (total 13 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   country_code        5295 non-null   object
 1   country_name        5295 non-null   object
 2   wb_income           5295 non-null   object
 3   wb_region           5295 non-null   object
 4   isic_section_index  5295 non-null   object
 5   isic_section_name   5295 non-null   object
 6   industry_id         5295 non-null   int64
 7   industry_name       5295 non-null   object
 8   net_per_10K_2015    5295 non-null   float64
 9   net_per_10K_2016    5295 non-null   float64
 10  net_per_10K_2017    5295 non-null   float64
 11  net_per_10K_2018    5295 non-null   float64
 12  net_per_10K_2019    5295 non-null   float64
dtypes: float64(5), int64(1), object(7)
memory usage: 537.9+ KB

#### Skill Migration

In [106]:
skill_migration.head()

,country_code,country_name,wb_income,wb_region,skill_group_id,skill_group_category,skill_group_name,net_per_10K_2015,net_per_10K_2016,net_per_10K_2017,net_per_10K_2018,net_per_10K_2019
0,af,Afghanistan,Low income,South Asia,2549,Tech Skills,Information Management,-791.59,-705.88,-550.04,-680.92,-1208.79
1,af,Afghanistan,Low income,South Asia,2608,Business Skills,Operational Efficiency,-1610.25,-933.55,-776.06,-532.22,-790.09
2,af,Afghanistan,Low income,South Asia,3806,Specialized Industry Skills,National Security,-1731.45,-769.68,-756.59,-600.44,-767.64
3,af,Afghanistan,Low income,South Asia,50321,Tech Skills,Software Testing,-957.50,-828.54,-964.73,-406.50,-739.51
4,af,Afghanistan,Low income,South Asia,1606,Specialized Industry Skills,Navy,-1510.71,-841.17,-842.32,-581.71,-718.64

In [124]:
skill_migration.shape

(17617, 12)

In [127]:
skill_migration.describe()

,skill_group_id,net_per_10K_2015,net_per_10K_2016,net_per_10K_2017,net_per_10K_2018,net_per_10K_2019
count,17617.000000,17617.000000,17617.00000,17617.000000,17617.000000,17617.000000
mean,6768.889368,-14.600256,-39.20081,-54.772238,-36.081342,-34.782431
std,11609.744113,255.690007,252.33377,256.931197,265.209723,239.798934
min,44.000000,-3037.380000,-2435.26000,-6604.670000,-3629.020000,-4022.040000
25%,618.000000,-106.160000,-119.24000,-121.460000,-111.440000,-111.740000
50%,2091.000000,-11.500000,-27.04000,-31.810000,-15.170000,-17.430000
75%,6189.000000,72.120000,58.85000,47.480000,65.940000,65.920000
max,50415.000000,2824.970000,1796.89000,1906.140000,1515.790000,1901.990000

In [128]:
skill_migration.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17617 entries, 0 to 17616
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   country_code          17617 non-null  object
 1   country_name          17617 non-null  object
 2   wb_income             17617 non-null  object
 3   wb_region             17617 non-null  object
 4   skill_group_id        17617 non-null  int64
 5   skill_group_category  17617 non-null  object
 6   skill_group_name      17617 non-null  object
 7   net_per_10K_2015      17617 non-null  float64
 8   net_per_10K_2016      17617 non-null  float64
 9   net_per_10K_2017      17617 non-null  float64
 10  net_per_10K_2018      17617 non-null  float64
 11  net_per_10K_2019      17617 non-null  float64
dtypes: float64(5), int64(1), object(6)
memory usage: 1.6+ MB